[
    { "name": "Kieran", "text": "(This is it. The pantry's wide open)", "background": "bg.jpg", "effect": "fadeIn"},
    { "text": "(No, be calm about this. How many times have you gotten into trouble because you were too eager about it?)", "effect": "flash"},
    { "text": "(The owner's at the front, so this is my chance!)"},
    { "text": "(Alright, it's go time!)"},
    { "text": "(Heh, too easy. Leaving the bread wide open)"},
    { "text": "(Finally, something to ea—)"},
    { "text": "(Huh?)"},
    { "name": "Cafe Owner", "text": "Hmph. I thought I heard a little rat come in here.", "char": "def.png"},
    { "name": "Kieran", "text": "Wh-what?!"},
    { "text": "(Drat! Where did he come from?!)"},
    {
        "text": "(What should I do? The bread's right there, and I can make a run for it. But, can this guy catch up to me? Or should I knock him out first?)",
        "choices": [
            { "text": "Run away with the bread", "jump": "runFromCafe" },
            { "text": "Fight him first, then take the bread", "jump": "fight" }
        ]
    },
    { "next": "runFromCafe", "name": "Kiernan", "text": "(Just have to trust my legs here!)"},
    { "name": "Cafe Owner", "text": "You! You're faster than I thought."},
    { "text": "Come back here!"},
    { "name": "Kieran", "text": "Hah! See ya later, sucker! And, thanks for the meal!"},
    { "text": "Hah...hah...finally, a decent meal...!"},
    { "text": "(I take a huge chomp of the freshly baked bread. It was soft, basically melting in my mouth. The best meal I've had in ages.)"},
    { "text": "Hehe, maybe I should ransack the place again once things settle down there."},
    { "text": "Hmm?"},
    { "text": "Who goes there?!"},
    { "name": "Thug 1", "text": "Heh. How impressive. I’m surprised you managed to find us out."},
    { "name": "Kieran", "text": "(Of course. I’ve lived in these parts my whole life. If I hadn’t honed my senses, I would have died long ago.)"},
    { "text": "So, I’m assuming you’re here to steal from me, huh? Can’t say I’m surprised. After all, I got myself a huge haul."},
    { "name": "Thug 1", "text": "Enough talking! Get him!"},
    { "name": "Kieran", "text": "Don't you dare-"},
    { "name": "", "text": "*BOOM*"},
    { "name": "Thug 2", "text": "What was that?"},
    { "name": "Thug 1", "text": "Hmph. Probably some firework or something. Wait, where did he go?!"},
    { "name": "Thug 2", "text": "Crap, he ran away while we were distracted!"},
    { "name": "Thug 1", "text": "Argh! You useless good-for-nothing!", "jump": "unfairLife"},

    { "next": "fight", "name": "Kiernan", "text": "(This guy is as jacked as can be. And he probably runs fast too. Can I even outrun him?)"},
    { "text": "(I’ll just have to knock him unconscious. But, can I do it?)"},
    { "text": "Argh!", "effect": "shake"},
    { "text": "(Wh-what?! I didn't even see him throw a punch!)"},
    { "name": "Cafe Owner", "text": "Pathetic. I've had better rugrats steal from this place than you."},
    { "name": "Kieran", "text": "(Dammit! What was I thinking?! As if I could fight a guy as big as him.)"},
    { "text": "(He might actually kill me at this rate! C’mon, something, anything! What can I use to stop him?!)"},
    { "name": "", "text": "*BOOM*", "effect": "shake"},
    { "name": "Cafe Owner", "text": "What was that?"},
    { "text": "Hmph, anyway- Wait, where did he go?"},
    { "name": "Kieran", "text": "Hah...hah..."},
    { "name": "", "text": "*rumbles*"},
    { "name": "Kieran", "text": "Crap...forgot to take the the bread with me too..."},
    { "text": "Guess I’m going hungry today..."},
    { "text": "No, there are still places I can go to. I’ll scout the place first.", "jump": "unfairLife"},

    { "next": "unfairLife", "name": "Kieran", "text": "Life has always been unfair to me. Nothing ever seemed to be going well for me."},
    { "text": "It was always one roadblock after another with nothing good ever coming my way."},
    { "text": "Huh? What do you mean everyone experiences hardship every once in a while?"},
    { "text": "Of course, I know that. It’s just that it always felt like life had something against me."},
    { "text": "Born in this poverty-stricken, good-for-nothing place with no one to support me, I guess you could say I grew up pretty quickly."},
    { "text": "I had to do whatever it took to survive in this god-forsaken place, even if it meant stealing from others."},
    { "text": "In the slums, you couldn’t trust anyone. If you did, they would stab you in the back the moment things start to turn sour."},
    { "text": "So, I lived my whole life, wandering around the town, the back alleys, searching and scavenging for my next meal."},
    { "text": "Can you even call it living though? Living this sorry excuse for a life?"},
    { "text": "Can I really continue to live my life like this...?"},
    { "name": "", "text": "*bump*"},
    { "name": "Kiernan", "text": "Ouch!"},
    { "text": "Who the hell...?!"},
    { "name": "???", "text": "Ah, here you are. I was looking all over for you."},
    { "name": "Kiernan", "text": "Huh? What are you on about?"},
    { "text": "(Don’t tell me...is he one of the guys I stole from before? Is he planning to take his revenge on me?)"},
    { "text": "Alright, you wanna fight, huh? Come at me, then!"},
    { "text": "(Mislead the target, if there’s an opening, steal whatever I can, and run away!)"},
    { "name": "", "text": "The stranger smiled mysteriously."},
    { "name": "???", "text": "Settle down. I am not here to harm you nor pick a fight with you."},
    { "name": "Kiernan", "text": "Hmm...is that so? (Yeah, right. Looks like he’s trying to let my guard down too."},
    { "name": "???", "text": "That magic... I didn’t expect you would awaken it so early."},
    { "name": "Kiernan", "text": "Magic? (What’s his plan? Why is he trying so hard to take advantage of me?)"},
    {
        "text": "C'mon, make a decision before it's too late!",
        "choices": [
            { "text": "Run away", "jump": "runFromStranger"},
            { "text": "Continue the plan to steal", "jump": "stealFromStranger"},
	    { "text": "Talk to the stranger", "jump": "talkToStranger"}
        ]
    },
    { "next": "runFromStranger", "name": "???", "text": "No can do."},
    { "name": "Kiernan", "text": "Huh?! (It’s like something is grabbing me!)"},
    { "name": "???", "text": "How many times are you going to run away, hm?"},
    { "name": "Kiernan", "text": "Ugh..."},
    { "name": "???", "text": "Now then, are you ready to talk?"},
    { "name": "Kiernan", "text": "About...?"},
    { "name": "???", "text": "Your magic.", "jump":  "continueTalkingToStranger"},

    { "next": "stealFromStranger", "name": "Kiernan", "text": "(He doesn’t have much from the looks of him, but he definitely has something. I can smell it!)"},
    { "name": "???", "text": "Don’t even think about it. I can tell what you’re thinking."},
    { "name": "Kiernan", "text": "!"},
    { "name": "???", "text": "But, don’t worry. I’ll forgive this transgression if you promise to give me a second to explain everything."},
    { "name": "Kiernan", "text": "(Did I just get punished for committing thought crimes?)"},
    { "name": "???", "text": "Now then, are you ready to talk?"},
    { "name": "Kiernan", "text": "About...?"},
    { "name": "???", "text": "Your magic.", "jump":  "continueTalkingToStranger"},

    { "next": "talkToStranger", "name": "Kiernan", "text": "(Maybe he has something worthwhile to say...)", "jump": "continueTalkingToStranger"},
    { "next": "continueTalkingToStranger", "name": "Kiernan", "text": "What's this about magic?"},
    { "name": "???", "text": "Yes, that small explosion over yonder there. That was you."},
    { "name": "Kiernan", "text": "That can’t be. It was just a coincidence. It was probably a firework or something."},
    { "name": "???", "text": "No, it was definitely a spell someone had cast. I can still sense the residue in the air."},
    { "name": "Kiernan", "text": "..."},
    { "text": "(Hmph. This guy... he’s trying to let my guard down, isn’t he? This is an old trick in the book.)"},
    { "name": "Kiernan", "text": "Heh, you can stop the charade now. You could have come up with a better excuse to distract and steal from me."},
    { "name": "???", "text": "I am not lying nor trying to deceive you."},
    { "name": "Kiernan", "text": "Look, how about this? Let’s settle this in a more civil manner. You and I can go our separate ways without having to go through this tedious process. How about it?"},
    { "name": "???", "text": "..."},
    { "name": "Kiernan", "text": "Hey! What the-"},
    { "name": "???", "text": "You give me no choice but to do this with force."},
    { "name": "Kiernan", "text": "Let me go!"},
    { "name": "???", "text": "Not until you hear me out."},
    { "name": "Kiernan", "text": "Okay, okay! I’ll hear you out. Just let me down!"},
    { "name": "???", "text": "No."},
    { "name": "Kiernan", "text": "You...!"},

    { "name": "", "text": "*slam*"},
    { "name": "Kiernan", "text": "Ow! You could have put me down gentler!"},
    { "name": "???", "text": "See those goblins over there?"},
    { "name": "Kiernan", "text": "Goblins?"},
    { "name": "???", "text": "Goblins have started to increase in number in this area. They’ve been nothing but a nuisance to others. They make for perfect target practice, don’t you think?"},
    { "name": "Kiernan", "text": "Wait, you want me to fight them?"},
    { "name": "???", "text": "What else were you thinking?"},
    { "name": "Kiernan", "text": "T-there’s no way I can do that... The only thing I can do is pickpocket and steal."},
    { "name": "Goblin", "text": "Grarrgh!"},
    { "name": "Kiernan", "text": "Ahh!"},

    { "name": "Kiernan", "text": "Hah...hah..."},
    { "text": "I...I really defeated one..."},
    { "name": "Kiernan", "text": "No way... I didn’t know I had it in me."},
    { "name": "???", "text": "Now, do you see?"},
    { "name": "Kiernan", "text": "Ah! Umm..."},
    { "name": "???", "text": "You are destined for greatness, Kiernan."},
    { "name": "Kiernan", "text": "Oh...? Really? Ha ha... wait, how do you know my name?"},
    { "name": "???", "text": "Oh my, that reminds me. I never told you my name, have I?"},
    { "name": "Kiernan", "text": "...okay..."},
    { "name": "???", "text": "I am Ulric, a humble teacher of sorts."},
    { "name": "Kiernan", "text": "Ulric, huh...?"},
    { "text": "(If I had known that I had the potential for magic, maybe my life wouldn't have been so hard...)"},
    { "name": "Ulric", "text": "Magic isn’t rare, but it isn’t often you meet a magic user."},
    { "text": "I nurtured those who awakened their potential for magic and guide them to become capable magic users."},
    { "name": "Kiernan", "text": "That’s nice and all, but I’m still wondering how you knew my name without me telling you."},
    { "name": "", "text": "Ulric’s face turned solemn."},
    { "name": "Ulric", "text": "Kiernan, the world is ending."},
    { "name": "Kiernan", "text": "..."},
    { "text": "...excuse me?"},
    { "name": "Ulric", "text": "The world is collapsing. After centuries of erosion and weathering, it has long grown past its prime."},
    { "text": "If humanity needs to stop the collapse, we will need to collect the six Origin Crystals, scattered around the world."},
    { "name": "Kiernan", "text": "Hold it!"},
    { "text": "W-what the hell are you talking about?!"},
    { "text": "You’re saying that the world is gonna end, and you expect me to just believe that?! For all I know, you could be just screwing around with me. Also, what are these Origin Crystals anyway?"},
    { "name": "Ulric", "text": "I am afraid all of this is true. A prophecy has foretold this."},
    { "name": "Kiernan", "text": "Prophecy?"},
    { "name": "Ulric", "text": "There is a prophecy going around in the upper echelons of society. It states that a party of heroes will rise together to collect the Origin Crystals and save the world."},
    { "text": "And you are one of them."},
    { "name": "Kiernan", "text": "..."},
    { "text": "...Haha..."},
    { "text": "Hahahaha..."},
    { "text": "Ahahahahaha!"},
    { "text": "Hehehe...g-good joke...hehehe...gosh, I haven’t heard such a funny joke in a long time..."},
    { "name": "Ulric", "text": "I am not joking."},
    { "name": "Kiernan", "text": "Yeah right, you’re probably screwing around with me right now. How do you even know this so-called prophecy anyway? Didn't you say that this prophecy was only known to the upper echelons of society?"},
    { "name": "Ulric", "text": "I see. Then, would you believe me if I showed you proof?"},
    { "name": "Kiernan", "text": "Proof?"},
    { "name": "Ulric", "text": "Come with me."},
    { "name": "Kiernan", "text": "What? No way! You’re definitely up to something."},
    { "name": "Ulric", "text": "Still as distrustful as ever, I see. No matter."},
    { "name": "Kiernan", "text": "Again?!"},
    { "name": "Ulric", "text": "Listen, I do not have any bad intentions towards you. I only want to save this world from destruction."},
    { "text": "If you do not listen, I have no choice but to use force to make you listen."},
    { "name": "Kiernan", "text": "And, who’s fault is that?! Suddenly popping up and spouting nonsense like a prophecy and whatever crystals!"},

    { "name": "Kiernan", "text": "...a church?"},
    { "name": "Ulric", "text": "One of the Origin Crystals is held here, specifically the Light Crystal."},
    { "text": "The church has been overseeing it for centuries. It is a closely guarded secret that only a select few know."},
    { "name": "Kiernan", "text": "And how do you know this...?"},
    { "name": "", "text": "Ulric smiled mysteriously"},
    { "name": "Ulric", "text": "Because I am one of the select few who’s in the know."},
    { "name": "Kiernan", "text": "That doesn’t answer my question."},
    { "name": "Ulric", "text": "Anyway, I can show you the crystal as proof that the Origin Crystals do indeed exist. I’ll also let you down if you promise to behave."},
    { "name": "Kiernan", "text": "...Fine, I promise."},
    { "text": "..."},
    {
        "text": "(Alright, time to dash!)",
        "choices": [
            { "text": "Run away", "jump": "runFromUlricChurch"},
            { "text": "Behave", "jump": "behaveChurch"}
        ]
    },
    { "next":  "runFromUlricChurch", "name": "Kiernan", "text": "Hah! See ya-"},
    { "name": "Kiernan", "text": "Huh?"},
    { "name": "Ulric", "text": "I knew you were going to do that."},
    { "name": "Kiernan", "text": "Argh! Okay, okay, fine I won’t run away! Promise!"},
    { "name": "Ulric", "text": "Hmph. The little rascal you are. But, no matter.", "jump" : "goToChurch"},

    { "next":  "behaveChurch", "name": "Kiernan", "text": "(...On second thought, he’ll probably catch me right away if I did...)"},
    { "text": "Ahem, well, shall we go now?"},
    { "name": "Ulric", "text": "Hmm, I did not expect you to behave so quickly. No matter. Come inside.", "jump":  "goToChurch"},

    { "next": "goToChurch", "name": "Kiernan", "text": "This is..."},
    { "name": "Ulric", "text": "The Originator, the god of this world, the one who created and shaped it."},
    { "name": "Kiernan", "text": "..."},
    { "text": "(Weird... there’s this burning sensation in my chest. It almost feels like...)"},
    { "text": "(...a deep hatred, almost loathing. But, why?)"},
    { "text": "(...Heh, I know why. It’s because for one who supposedly loves all of humanity, did he ever do anything to help me out of my situation?"},
    { "name": "Ulric", "text": "This way."},
    { "name": "Kiernan", "text": "Huh? W-wait for me!"},
    { "text": "Hey...where are we? Why are we all in the way in the back?"},
    { "name": "Ulric", "text": "This is where the Light Crystal is held."},
    { "name": "Kiernan", "text": "...This is just a wall."},
    { "text": "Hah! I knew it. You were just tricking me. You’re actually here to rob me, right? Well, I don’t have much, so get ready to be disappointed."},
    { "name": "Ulric", "text": "The crystal is behind this wall. And I want you to open it."},
    { "name": "Kiernan", "text": "What are you on about?"},
    { "name": "Ulric", "text": "Consider this as another test. To prove that you are a hero destined to save the world."},
    { "name": "Kiernan", "text": "That doesn’t prove I’m a hero or anything. It’s just opening a wall."},
    { "name": "Ulric", "text": "Go on, open it."},
    { "name": "Kiernan", "text": "(...He’s ignoring me...)"},
    { "name": "Ulric", "text": "I knew you had it in you. You really are a hero of the prophecy."},
    { "name": "Kiernan", "text": "Like I said, this doesn’t prove anything!"},
    { "name": "Ulric", "text": "Shall we?"},
    { "name": "Kiernan", "text": "*cough* *cough* Ugh, why is it so dusty?!"},
    { "name": "Ulric", "text": "No one has been down here for years. Of course, the place would be covered in dust."},
    { "text": "The crystal is up ahead. No time for dilly-dallying."},
    { "name": "Kiernan", "text": "(This feeling... it’s warm, kind. It almost feels like something ethereal.)"},
    { "name": "Kiernan", "text": "Is this the Light Crystal?"},
    { "name": "Ulric", "text": "It is."},
    { "name": "Kiernan", "text": "It’s... beautiful..."},
    { "name": "Ulric", "text": "Do you believe me now?"},
    { "name": "Kiernan", "text": "(...the crystal feels so... powerful. Like it has been here since time immemorial.)"},
    { "text": "...fine, I’ll believe you for now. I have nothing better to do anyway."},
    { "name": "Ulric", "text": "Hmm... we still need to work on your attitude, but that is a matter for another time."},
    { "name": "Kiernan", "text": "By the way, you never told me what the Origin Crystals are."},
    { "name": "Ulric", "text": "Hmm. Oh, yes, I suppose I did."},
    { "text": "The Originator created six artifacts when he created the world."},
    { "text": "There are the four Elemental Crystals: Fire, Water, Earth, and Air."},
    { "text": "Fire to create warmth against the frigid cold, water to let us drink and thrive, earth to offer the land on which we place our feet on, and air to give us the oxygen for us to breathe."},
    { "text": "Without the Elemental Crystals, we wouldn’t be standing in a world where we can all live and prosper."},
    { "text": "Then, there are the two Moral Crystals: Light and Dark. The Light Crystal is the source of the righteousness and goodness of man, while the Dark Crystal is the source of the evil and wickedness of man."},
    { "text": "Without the Light Crystal, man would cast upon their vile desires unto others and the world."},
    { "text": "However, without the Dark Crystal, man would be content with stagnancy and wouldn’t strive for change. The two create a balance upon which our world is built."},
    { "text": "Together, the six make up the Origin Crystals that sustain and maintain this world."},
    { "name": "Kiernan", "text": "(...I can’t believe it. Me, a chosen hero of a prophecy? Collecting crystals made by a god? This is all too much.)"},
    { "text": "(But this crystal feels real. It really does feel like a creation made by a god.)"},
    { "text": "(However...even though my brain is telling me that this is the greatest opportunity I could ever receive-to finally leave that life of pickpocketing and thievery...why does my heart tell me no...?)"},
    {
        "text": "(What do I do?)",
        "choices": [
            { "text": "Become a hero", "jump":  "becomeHero"},
            { "text": "Reject becoming a hero", "jump":  "rejectHero"}
        ]
    },
    { "next": "rejectHero", "name": "Ulric", "text": "I’m sorry, I haven’t heard your response yet. What do you say?"},
    {
	"name": "",
        "text": "",
        "choices": [
            { "text": "Become a hero", "jump":  "becomeHero"},
            { "text": "Reject becoming a hero", "jump":  "rejectHero"}
        ]
    },

    { "next": "becomeHero", "name": "Kiernan", "text": "Fine, I’ll go along with this so-called prophecy. It’s better than wondering when my next meal will come."},
    { "name": "", "text": "A look of relief washes over Ulric’s face."},
    { "name": "Ulric", "text": "Thank you. This world will be saved after all."},
    { "name": "Kiernan", "text": "So, what does this hero need to do?"},
    { "name": "Ulric", "text": "The only known location that we have confirmed of one of the crystals is the Earth Crystal, located deep in the forest of the elves."},
    {  "text": "The whereabouts of the other crystals, however, are unknown to us. We can only guess based on their general geography."},
    { "name": "Kiernan", "text": "I see... (I guess that means the Earth Crystal is my first stop on this hero’s journey.)"},
    { "name": "Ulric", "text": "I know that you are eager to start on your heroic adventure, but what every hero needs is a good place to tuck in and sleep."},
    { "text": "After all, you cannot save the world without a good night’s rest."},
    { "name": "Kiernan", "text": "A place to sleep? (I have to be dreaming. The best place I ever slept in was...)"},
    { "text": "(Hmm? Weird, I can’t seem to remember. What was the best place I ever slept in...?)"},
    { "name": "Ulric", "text": "Here is a bag of coins for you."},
    { "name": "Kiernan", "text": "Huh?! You’re giving me money?!"},
    { "name": "Ulric", "text": "Yes. For you to fulfill your basic necessities."},
    { "name": "Kiernan", "text": "I-I-I-I-I- (T-this is more than all the money I pickpocketed from other people combined...!)"},
    { "name": "Ulric", "text": "And don’t even think about running away again or else..."},
    { "name": "Kiernan", "text": "Y-yes, sir! (He didn’t even finish his threat, but I know he can do the worst possible things to me if I really do run away.)"},
    { "name": "Ulric", "text": "Hmm, that’s a good boy. Now then, I shall take you back upstairs."},
    { "text": "This is where we shall part ways for now."},
    { "name": "Kiernan", "text": "Huh? Where are you going?"},
    { "name": "Ulric", "text": "To attend business. Meanwhile, you should be off looking for an inn to stay at and perhaps treat yourself to a delicious meal."},
    { "name": "Kiernan", "text": "I see... (Enough with the mysteriousness already.)"},
    { "name": "Ulric", "text": "Well then, I’ll be back to monitor your progress."},
    { "name": "Kiernan", "text": "..."},
    { "text": "Wait!"},
    { "name": "Ulric", "text": "What is it?"},
    { "name": "Kiernan", "text": "Umm...well...I-um-"},
    { "text": "(The words I tried to let out of my mouth felt foreign to me. In the slums, rarely did you ever need to feel indebted towards someone.)"},
    { "text": "Well...thank you..."},
    { "name": "", "text": "Ulric smiled."},
    { "name": "Ulric", "text": "Hmm...your attitude has become much more tolerable than before."},
    { "name": "Kiernan", "text": "Don’t make me take them back, old man!"},
    { "name": "Ulric", "text": "How amusing. I’ll be off then."},
    { "name": "Kiernan", "text": "*sigh* (So, I guess I should find a place to sleep then.)"},
    { "text": "(I found the closest inn I could find and stayed in.)"},
    { "text": "(The bed was the most comfiest thing I ever slept on, and I fell asleep right away, partly due to the softness of it but mostly because of all of revelations that were revealed to me that day.)"},
    { "text": "..."},
    { "text": "A hero, huh? (Maybe, I can finally live a worthwhile life.)"}
]
