[
    { "name": "Cafe Owner", "text": "Phew, what a busy hour.", "char": "chiikawa.png"},
    { "text": "All of my customers took what's left of the stock."},
    { "text": "Hmm, but I should take a break first. It's time to do my training."},
    { "text": "..."},
    { "text": "Who's there?"},
    { "name": "narrator", "text": "..."},
    { "name": "Kiernan", "text": "You got sharp senses there."},
    { "name": "narrator", "text": "A figure appeared out of a whirlwind of shadows."},
    { "name": "Cafe Owner", "text": "Hmph, I may be retired from adventuring, but that doesn't mean I'll let my skills get rusty."},
    { "name": "Kiernan", "text": "All I ask is one loaf of bread, and we can settle this peacefully."},
    { "name": "Cafe Owner", "text": "You got some guts, even thinking of the possibility I'll let some rat steal from my place."},
    { "name": "Kiernan", "text": "...It seems we have to do this the hard way."},
    { "text": "(Let's see. I can steal the bread first, then run away. But, it does pose a risk of the owner chasing after my tail.)"},
    { "text": "(Or I could try to beat him in a fight, then safely take the bread with me. Of course, losing is very likely, seeing that he used to fight and adventure in the wild.)"},
    {
        "text": "(Calmly think about this, Kiernan.)",
        "choices": [
            { "text": "Run away with the bread", "jump": "runFromCafe", "alignment": "friendship", "setFlag": "ranAwayWithBread" },
            { "text": "Fight him first, then take the bread", "jump": "fightOwner", "alignment": "evil"}
        ]
    },

    { "next": "runFromCafe", "name": "narrator", "text": "Kiernan's figure blended into the shadows, swiftly taking the loaf of bread with him."},
    { "name": "narrator", "text": "However..."},
    { "name": "narrator", "text": "*PUNCH*", "effect": "shake"},
    { "name": "Kiernan", "text": "Guh!"},
    { "name": "Cafe Owner", "text": "Don't take me for a fool. Using dark magic to hide yourself in the shadows--a predictable tactic."},
    { "name": "narrator", "text": "*FLARE*", "effect": "flash"},
    { "name": "Cafe Owner", "text": "Wh--"},
    { "name": "narrator", "text": "The cafe owner quickly dodged the attack."},
    { "name": "Cafe Owner", "text": "Fire magic too--", "jump": "afterCafeOwner"},

    { "next": "fightOwner", "name": "Cafe Owner", "text": "Oh? You're approaching me?"},
    { "name": "narrator", "text": "Fire covered Kiernan's fists as he threw in a punch."},
    { "name": "Cafe Owner", "text": "Too slow."},
    { "name": "narrator", "text": "*PUNCH*", "effect": "shake"},
    { "name": "Kiernan", "text": "Guh!"},
    { "name": "Cafe Owner", "text": "I've had better rugrats steal from this place than you. Hmm?"},
    { "name": "narrator", "text": "*WHAM*", "effect": "shake"},
    { "name": "narrator", "text": "A whip of darkness lashed out for his legs."},
    { "name": "Cafe Owner", "text": "Tch, first it's fire magic, then it's dark magic too...?"},
    { "text": "Wait, the bread--", "jump": "afterCafeOwner"}, 

    { "next": "afterCafeOwner", "name": "Kiernan", "text": "(Run!)", "effect": "speedBurst"},
    { "name": "Cafe Owner", "text": "Get back here!", "effect": "speedBurst"},
    { "name": "Kiernan", "text": "So long!", "effect": "speedBurst"},
    { "text": "Hah...hah...I think I finally managed to lose him..."},
    { "text": "Life had never been fair to me. Born in a poverty-stricken place with no one to support me, I guess you could say I grew up pretty quickly."},
    { "text": "From a young age, I had to steal and pickpocket from others in order to survive."},
    { "text": "Even though the people running the town say that they will help the people of the slums, they never do. It's all just lip service, serving to make themselves look better."},
    { "text": "And it wasn't just them either. You couldn't even trust the people in the slums. If you did, they would stab you in the back the moment things start to turn sour."},
    { "text": "So, I lived my whole life wandering around the town, the back alleys, searching and scavenging for my next meal."},
    { "text": "Can you even call it living, though? Living this sorry excuse for a life?"},
    { "text": "There has to be some sort of greater purpose I can live. I just have to find it."},
    { "text": "Well, at least I got a decent haul--"},
    { "name": "narrator", "text": "*CRACK*"},
    { "name": "Kiernan", "text": "Huh? What was that?"},
    { "text": "..."},
    { "text": "Nothing seems to be out of place--"},
    { "text": "...Who's there?"},
    { "name": "Thug 1", "text": "Heh. How impressive. I'm surprised you managed to find us out.", "leftChar": "hachiware.png", "rightChar": "usagi.png"},
    { "name": "Kiernan", "text": "You severely underestimated me. An ambush won't be enough to take me down, especially after making a blunder like exposing yourself so easily."},
    { "name": "Thug 1", "text": "Don't get me wrong. Whatever that sound was, it didn't come from us."},
    { "name": "Kiernan", "text": "It doesn't matter. You don't know who you're dealing with."},
    { "name": "Thug 2", "text": "Is that a threat?"},
    { "name": "Thug 1", "text": "Enough talk. Get him!"},
    { "name": "narrator", "text": "Turn-based Battle", "minigame": "battle"},
    { "name": "Thug 2", "text": "Damnit, run!"},
    { "name": "Thug 1", "text": "You don't have to tell me that a second time!"},
    { "name": "Kiernan", "text": "What nuisances. (Anyway, I should eat my well-deserved meal.)"},
    { "name": "narrator", "text": "*CRACK*"},
    { "name": "Kiernan", "text": "Huh? Again? Just what is that sound?"},
    { "name": "???", "text": "Ah, there you are."},
    { "name": "Kiernan", "text": "Huh?"},
    { "name": "???", "text": "I was looking all over for you."},
    { "name": "Kiernan", "text": "What are you talking about? Who are you? (...Is he one of the guys I stole from before?)"},
    { "text": "Hmm, I see. You want to take revenge on me for stealing from you. (I'm confident in my abilities. Besides, he's only an old man. I can take him on.)"},
    { "name": "???", "text": "Settle down. I am not here to fight nor harm you."},
    { "name": "Kiernan", "text": "Is that so? (I can't let my guard down. He's clearly here to take advantage of me.)"},
    { "text": "(But I can also use this situation to my advantage too--)"},
    { 
        "text": "(Make a choice before it's too late!)", 
        "choices": [
            { "text": "Run away", "jump": "runAwayFromStranger", "alignment": "coward"},
            { "text": "Steal from the stranger", "jump": "stealFromStranger", "alignment": "evil"},
            { "text": "Talk with the stranger", "jump": "talkToStranger", "alignment": "friendship"}
    ]},

    { "next": "runAwayFromStranger", "name": "???", "text": "An old tactic you frequently use. Honestly, it's becoming quite tiring."},
    { "name": "Kiernan", "text": "Huh?! (It's like something is grabbing me!)"},
    { "name": "???", "text": "How many times are you going to run away?"},
    { "name": "Kiernan", "text": "Ugh..."},
    { "name": "???", "text": "Now then, I suppose introductions are in order.", "jump": "continueTalkingToStranger"},

    { "next": "stealFromStranger", "name": "Kiernan", "text": "(Even an old man like him can have something valuable on him. I can basically smell it!)"},
    { "name": "???", "text": "Don't even think about it. I can tell what you're thinking."},
    { "name": "Kiernan", "text": "!"},
    { "name": "???", "text": "But, don't worry. I'll forgive this transgression if you promise to give me a second to explain everything."},
    { "name": "Kiernan", "text": "(I-I almost got punished for committing thought crimes.)"},
    { "name": "???", "text": "Now then, I suppose introductions are in order.", "jump": "continueTalkingToStranger"},

    { "next": "talkToStranger", "name": "Kiernan", "text": "(...I don't know. Somehow, this old man...I don't think I can get away from messing with him.)"},
    { "text": "(Maybe, I'll play it safe and try to get on his good side.)"},
    { "text": "Can we...talk this out?"},
    { "name": "???", "text": "Ah, you're unusually cooperative right now. Strange, how strange."},
    { "name": "Kiernan", "text": "Huh?"},
    { "name": "???", "text": "But, no matter. I suppose some introductions and explainations are in order.", "jump": "continueTalkingToStranger"},

    { "next": "continueTalkingToStranger", "text": "I am Ulric, a humble teacher who teaches the art of magic."},
    { "name": "Kiernan", "text": "I see...what does a magic teacher want to do with me?"},
    { "name": "Ulric", "text": "Do not play dumb with me. I already know of your magic ability."},
    { "text": "A highly talented mage with affinities for fire and dark. For someone who was self-taught, you are quite a capable magic user."},
    { "name": "Kiernan", "text": "You must be confusing me with someone else, old man. I'm just an ordinary person with absolutely no magic prowess."},
    { "name": "Ulric", "text": "A pointless lie. Any mage can see the mana oozing out from you."},
    { "name": "Kiernan", "text": "...*sigh* I guess, there wasn't any point in hiding it."},
    { "name": "Ulric", "text": "A useless endeavor."},
    { "name": "Kiernan", "text": "You--"},
    { "text": "(But now that I think about it, this old man is also a mage.)"},
    { "text": "(But if that's the case, why can't I sense any mana coming off of him?)"},
    { "name": "Ulric", "text": "Now, onto the most important question I have."},
    { "text": "You heard a loud crack sometime ago, correct?"},
    { "name": "Kiernan", "text": "Huh? (I did, but what does it have to do with this?)"},
    { "name": "Ulric", "text": "Look at the sky."},
    { "name": "narrator", "text": "It was a small sliver of a crack, but it was there. A small crack in the sky."},
    { "name": "Kiernan", "text": "T-The sky...! That definitely wasn't there before...!"},
    { "text": "What's going on?!"},
    { "name": "Ulric", "text": "Kiernan, you have to listen to me."},
    { "name": "Kiernan", "text": "What? How do you know my name?"},
    { "name": "Ulric", "text": "Kiernan."},
    { "text": "The world is ending."},
    { "name": "Kiernan", "text": "..."},
    { "text": "..."},
    { "text": "..."},
    { "text": "...What...?"},
    { "name": "Ulric", "text": "This world is past its prime and is collapsing as we speak. After centuries of erosion and weathering, I'm afraid that the world isn't able to hold on much longer."},
    { "name": "Kiernan", "text": "...What? What are you talking about...?!"},
    { "name": "Ulric", "text": "If humanity has to stop the collapse, we will need to collect the six Origin Crystals, forged by the Originator, scattered across the world."},
    { "text": "With the crystals in hand, we will be able to restore and rejuvenate the world, back to its prime."},
    { "name": "Kiernan", "text": "Stop! Hold it! Just let me have something to say!"},
    { "text": "You go off, spouting things like the world is gonna end and whatever crystals, but where's your proof?"},
    { "name": "Ulric", "text": "Isn't that the proof you need?"},
    { "name": "narrator", "text": "He points at the crack in the sky."},
    { "name": "Kiernan", "text": "...Yes, but it could be just some...unique weather phenomenon..."},
    { "name": "Ulric", "text": "Do you really believe that to be the case?"},
    { "name": "Kiernan", "text": "I can't just believe everything you've said."},
    { "text": "(I know something is up. This whole thing reeks of suspicion)"},
    { "name": "Ulric", "text": "How about this? I will show you one of the crystals. A genuine creation made by the Originator."},
    { "name": "Kiernan", "text": "One of the crystals?"},
    { "name": "Ulric", "text": "Yes. The crystals are what make up the world, both physical and incorporeal."},
    { "text": "The Originator created the Origin Crystals when he created the world and its first humans."},
    { "text": "However, the humans lacked reason, thought, and morality. Thus, the Originator created the Light and Dark Crystals."},
    { "text": "The Light Crystal is the source of the righteousness and goodness of man, while the Dark Crystal is the source of the evil and wickedness of man."},
    { "text": "Without the Light Crystal, man would cast upon their vile desires unto others and the world. However, without the Dark Crystal, man would be content with stagnancy and wouldn't strive for change."},
    { "text": "The two create a balance upon which our world is built. They are called the Moral Crystals for they are the foundation of man's nature."},
    { "text": "However, the humans did not have a foothold to place their feet upon and drifted into the emptiness of space."},
    { "text": "So, the Originator forged the Earth Crystal to offer us the earth and land on which we place our feet on."},
    { "text": "The humans were grateful, but they could not voice their praises as they were deprived of oxygen and could not talk nor breathe."},
    { "text": "Thus, the Originator formed the Air Crystal to cleanse the atmosphere of impurities."},
    { "text": "The humans sang their praises, but their praises were cut short as they shivered in the bitter cold."},
    { "text": "Therefore, the Originator built the Fire Crystal to combat the frigid cold."},
    { "text": "The humans tried to say their thanks but could not speak as their throats were coarse."},
    { "text": "Finally, the Originator constructed the Water Crystal to satisfy our thirst."},
    { "text": "These four crystals make up the Elemental Crystals. Without them, we wouldn't be standing in a world where we can place our feet on and live."},
    { "name": "Kiernan", "text": "... (For something that is so essential to maintaining the world--how come I never heard of these so-called crystals?)"},
    { "name": "Ulric", "text": "Like I said before, I will show you one of the crystals, the Light Crystal."},
    { "name": "Kiernan", "text": "Hah! Can you, old man?"},
    { "name": "Ulric", "text": "Only if you come with me."},
    { "name": "Kiernan", "text": "No way! Why would I go with some shady guy like you?"},
    { "name": "Ulric", "text": "..."},
    { "name": "narrator", "text": "*whoosh*", "effect": "shake"},
    { "name": "Kiernan", "text": "Hey! What the-"},
    { "name": "Ulric", "text": "You give me no choice but to do this with force."},
    { "name": "Kiernan", "text": "Let me go!"},
    { "name": "Ulric", "text": "Not until you hear me out."},
    { "name": "Kiernan", "text": "Okay, fine! I’ll hear you out. Just let me down!"},
    { "name": "Ulric", "text": "Only a fool would believe you."},
    { "name": "Kiernan", "text": "Argh! You...!"},
    { "text": "...a church?"},
    { "name": "Ulric", "text": "Yes, the church has been overseeing the Light Crystal for centuries. It is a closely guarded secret that only a select few know."},
    { "name": "Kiernan", "text": "And how do you know this...?"},
    { "name": "Ulric", "text": "Because I am one of the select few who’s in the know."},
    { "name": "Kiernan", "text": "That doesn’t answer my question."},
    { "name": "Ulric", "text": "Anyway, I can show you the crystal as proof that the Origin Crystals do indeed exist. I’ll also let you down if you promise to behave."},
    { "name": "Kiernan", "text": "...Fine, I promise."},
    { "name": "narrator", "text": "Ulric lets Kiernan down."},
    { "name": "Kiernan", "text": "..."},
    {
        "text": "(Alright, time to dash!)",
        "choices": [
            { "text": "Run away", "jump": "runFromUlricChurch", "alignment": "coward"},
            { "text": "Behave", "jump": "behaveChurch", "alignment": "friendship"}
        ]
    },
    { "next":  "runFromUlricChurch", "name": "Kiernan", "text": "Hah! See ya-"},
    { "name": "Kiernan", "text": "Huh?", "effect": "shake"},
    { "name": "Ulric", "text": "I knew you were going to do that. You are far too predictable."},
    { "name": "Kiernan", "text": "Argh! Okay, okay, fine I won't run away! Just let me down!"},
    { "name": "Ulric", "text": "Hmph. The little rascal you are. But, no matter.", "jump" : "goToChurch"},

    { "next":  "behaveChurch", "name": "Kiernan", "text": "(...On second thought, he'll probably catch me right away if I did...)"},
    { "text": "Ahem, well, shall we go now?"},
    { "name": "Ulric", "text": "Hmm, I did not expect you to behave so quickly. No matter. Come inside.", "jump":  "goToChurch"},

    { "next": "goToChurch", "name": "Kiernan", "text": "This is..."},
    { "name": "Ulric", "text": "The Originator, the god of this world, the one who created and shaped it."},
    { "name": "Kiernan", "text": "..."},
    { "text": "(I can't place my finger on why, but...there's this burning sensation in my chest. It almost feels like...)"},
    { "text": "(...a deep hatred, almost loathing. But, why?)"},
    { "text": "(...Heh, no, I know why. It's because for one who supposedly loves all of humanity, did he ever do anything to help me out of my situation?)"},
    { "text": "Old man, if the Originator is this high and almighty being, then wouldn't he be able to prevent the end of the world?"},
    { "name": "Ulric", "text": "He would be able to. But, divine intervention bears a heavy price."},
    { "name": "Kiernan", "text": "That's just basically saying that he can't fix this world without consequence."},
    { "name": "Ulric", "text": "I advise you not to speak ill of the one who created all of us and cared for our growth."},
    { "name": "Kiernan", "text": "... (He's angry. Better not pursue this topic anymore.)"},
    { "name": "Ulric", "text": "Hmph, but he is benevolent and merciful for he has given us a chance. A chance to prevent the end of the world with our own hands."},
    { "text": "The Originator does not guide mankind towards destruction but prosperity. Thus, the end of the world will be prevented."},
    { "name": "Kiernan", "text": "...okay. So, where is this so-called Light Crystal?"},
    { "name": "Ulric", "text": "This way."},
    { "name": "Kiernan", "text": "Huh? Wait for me!"},
    { "text": "Hey...where are we? Why are we all in the way in the back?"},
    { "name": "Ulric", "text": "This is where the Light Crystal is held."},
    { "name": "Kiernan", "text": "...This is just a wall."},
    { "name": "Ulric", "text": "The crystal is behind this wall. And I want you to open it."},
    { "name": "Kiernan", "text": "What are you on about?"},
    { "name": "Ulric", "text": "Consider this as another test. To prove that you are the chosen one that will save this world."},
    { "name": "Kiernan", "text": "That doesn't prove I'm a hero or anything. It's just opening a wall."},
    { "name": "Ulric", "text": "Go on, open it."},
    { "name": "Kiernan", "text": "(...He's ignoring me...)"},
    { "name": "narrator", "text": "Memory Game", "minigame": "memory"},

    { "name": "Ulric", "text": "I knew you had it in you. You really are a chosen one."},
    { "name": "Kiernan", "text": "Like I said, this doesn't prove anything!"},
    { "name": "Ulric", "text": "Shall we?"},
    { "name": "Kiernan", "text": "*cough* *cough* Ugh, why is it so dusty?!"},
    { "name": "Ulric", "text": "No one has been down here for years. Of course, the place would be covered in dust."},
    { "text": "The crystal is up ahead. No time for dilly-dallying."},
    { "name": "Kiernan", "text": "(This feeling... it's warm, kind. It almost feels like something ethereal.)"},
    { "name": "Kiernan", "text": "Is this the Light Crystal?"},
    { "name": "Ulric", "text": "It is."},
    { "name": "Kiernan", "text": "It's... beautiful..."},
    { "name": "Ulric", "text": "Do you believe me now?"},
    { "name": "Kiernan", "text": "(...the crystal feels so... powerful. Like it has been here since time immemorial.)"},
    { "text": "...This crystal..."},
    { "name": "Ulric", "text": "Was made by the Originator, yes."},
    { "name": "Kiernan", "text": "(I can believe that. I can tell that this crystal holds immense power...like it really was created by a god.)"},
    { "text": "...I believe you...for now."},
    { "name": "Ulric", "text": "Kiernan, you have to collect the rest of the crystals and save the world."},
    { "name": "Kiernan", "text": "But, why me? Why not ask someone more trustworthy or powerful like the archmages?"},
    { "name": "Ulric", "text": "I do not trust them. They will likely use the crystals for illicit purposes."},
    { "text": "I trust you more than those archmages. You are more special than you realize."},
    { "name": "Kiernan", "text": "You act like we've known each other for years, but we haven't met until now."},
    { "name": "Ulric", "text": "I trust in my judgement."},
    { "name": "Kiernan", "text": "(Being tasked to save the world. Maybe this is my chance--my chance to find out my reason for living.)"},
    { "text": "(For all I can remember, I wandered the streets, just wanting to survive.)"},
    { "text": "(But, it became more than a desire to survive, but to actually live--live a purposeful live.)"},
    { "text": "(Maybe through this, I can finally find that purpose. Maybe through this, I can live a life I was proud of.)"},
    { "text": "(However...even though my brain is telling me that this is the greatest opportunity I could ever receive...why does my heart tell me no...?)"},
    {
        "text": "(What do I do?)",
        "choices": [
            { "text": "Become a hero", "jump":  "becomeHero"},
            { "text": "Reject becoming a hero", "jump":  "rejectHero"}
        ]
    },

    { "next": "rejectHero", "name": "Ulric", "text": "I'm sorry, I haven't heard your response yet. What do you say?"},
    {
	    "name": "",
        "text": "",
        "choices": [
            { "text": "Become a hero", "jump":  "questionBecomeHero"},
            { "text": "Reject becoming a hero", "jump":  "rejectHero"}
        ]
    },

    { "next": "questionBecomeHero", "name": "Kiernan", "text": "I...don't have a choice in the matter, do I?"},
    { "name": "Ulric", "text": "That is not true. You always had a choice."},
    { "text": "But rejecting your duty to save the world and its people-Doesn't it leave a bad taste in your mouth?"},
    { "name": "Kiernan", "text": "(I didn't ask to be a hero or something. This duty was suddenly thrusted upon me. I'm not some noble saint who is insanely kind. No, I couldn't care less about the world. All I wanted to do was survive."},
    { "text": "(But whenever I try to reject him, it feels like something is preventing me from voicing my objections..."},
    { "text": "I'll do it. But only if I'm rewarded.", "jump": "becomeHeroReal"},

    { "next": "becomeHero", "name": "Kiernan", "text": "Fine, I'll go along with this hero roleplay. But only if I'm rewarded for this."},
    { "text": "(Though, considering how adamant he is about this chosen one stuff, rejecting him would have probably ended worse for me.)", "jump": "becomeHeroReal"},

    { "next": "becomeHeroReal", "name": "", "text": "A look of relief washes over Ulric's face."},
    { "name": "Ulric", "text": "Thank you. This world will be saved after all."},
    { "name": "Kiernan", "text": "But you never told me why the world is ending."},
    { "name": "Ulric", "text": "I did, Kiernan. Were you not paying attention? The crystals eroded with time and with it, the world."},
    { "text": "And restoring the crystals, the foundation for this world, also means restoring the world."},
    { "name": "Kiernan", "text": "... (That doesn't make sense. Wouldn't a god's creations be more...immune to time and erosion?)"},
    { "text": "(These crystals...Maybe it was because they were creations by a god or maybe because I was literally holding the foundation of the world in my hands, but...)"},
    { "text": "(...something about them felt dangerous.)"},
    { "text": "(But, there was also something about them that was sweetly enticing to me, like they were calling for me, begging me to retrieve them.)"},
    { "text": "(But, most importantly of all, there's no doubt about it.)"},
    { "text": "(This old man is hiding something. Something that he desperately doesn't want me to know.)"}
]
