[
    { "name": "Cafe Owner", "text": "Phew, what a busy hour.", "char": "chiikawa.png", "background":"bg.jpg", "music":"FU2.mp3"},
    { "text": "All of my customers took what's left of the stock."},
    { "text": "Hmm, but I should take a break first. It's time to do my training."},
    { "text": "..."},
    { "text": "Who's there?"},
    { "name": "narrator", "text": "..."},
    { "name": "Kiernan", "text": "You got sharp senses there."},
    { "name": "narrator", "text": "A figure appeared out of a whirlwind of shadows."},
    { "name": "Cafe Owner", "text": "Hmph, I may be retired from adventuring, but that doesn't mean I'll let my skills get rusty."},
    { "name": "Kiernan", "text": "All I ask is one loaf of bread, and we can settle this peacefully."},
    { "name": "Cafe Owner", "text": "You got some guts, even thinking of the possibility I'll let some rat steal from my place."},
    { "name": "Kiernan", "text": "...It seems we have to do this the hard way."},
    { "text": "(Let's see. I can steal the bread first, then run away. But, it does pose a risk of the owner chasing after my tail.)"},
    { "text": "(Or I could try to beat him in a fight, then safely take the bread with me. Of course, losing is very likely, seeing that he used to fight and adventure in the wild.)"},
    {
        "text": "(Calmly think about this, Kiernan.)",
        "choices": [
            { "text": "Run away with the bread", "jump": "runFromCafe", "alignment": "friendship", "setFlag": "ranAwayWithBread" },
            { "text": "Fight him first, then take the bread", "jump": "fightOwner", "alignment": "evil"}
        ]
    },

    { "next": "runFromCafe", "name": "narrator", "text": "Kiernan's figure blended into the shadows, swiftly taking the loaf of bread with him."},
    { "name": "narrator", "text": "However..."},
    { "name": "narrator", "text": "*PUNCH*", "effect": "shake"},
    { "name": "Kiernan", "text": "Guh!"},
    { "name": "Cafe Owner", "text": "Don't take me for a fool. Using dark magic to hide yourself in the shadows--a predictable tactic."},
    { "name": "narrator", "text": "*FLARE*", "effect": "flash"},
    { "name": "Cafe Owner", "text": "Wh--"},
    { "name": "narrator", "text": "The cafe owner quickly dodged the attack."},
    { "name": "Cafe Owner", "text": "Fire magic too--", "jump": "afterCafeOwner"},

    { "next": "fightOwner", "name": "Cafe Owner", "text": "Oh? You're approaching me?"},
    { "name": "narrator", "text": "Fire covered Kiernan's fists as he threw in a punch."},
    { "name": "Cafe Owner", "text": "Too slow."},
    { "name": "narrator", "text": "*PUNCH*", "effect": "shake"},
    { "name": "Kiernan", "text": "Guh!"},
    { "name": "Cafe Owner", "text": "I've had better rugrats steal from this place than you. Hmm?"},
    { "name": "narrator", "text": "*WHAM*", "effect": "shake"},
    { "name": "narrator", "text": "A whip of darkness lashed out for his legs."},
    { "name": "Cafe Owner", "text": "Tch, first it's fire magic, then it's dark magic too...?"},
    { "text": "Wait, the bread--", "jump": "afterCafeOwner"}, 

    { "next": "afterCafeOwner", "name": "Kiernan", "text": "(Run!)", "effect": "speedBurst"},
    { "name": "Cafe Owner", "text": "Get back here!", "effect": "speedBurst"},
    { "name": "Kiernan", "text": "So long!", "effect": "speedBurst"},
    { "text": "Hah...hah...I think I finally managed to lose him...", "char": "null"},
    { "text": "Life had never been fair to me. Born in a poverty-stricken place with no one to support me, I guess you could say I grew up pretty quickly."},
    { "text": "From a young age, I had to steal and pickpocket from others in order to survive."},
    { "text": "Even though the people running the town say that they will help the people of the slums, they never do. It's all just lip service, serving to make themselves look better."},
    { "text": "And it wasn't just them either. You couldn't even trust the people in the slums. If you did, they would stab you in the back the moment things start to turn sour."},
    { "text": "So, I lived my whole life wandering around the town, the back alleys, searching and scavenging for my next meal."},
    { "text": "Can you even call it living, though? Living this sorry excuse for a life?"},
    { "text": "There has to be some sort of greater purpose I can live. I just have to find it."},
    { "text": "Well, at least I got a decent haul--"},
    { "name": "narrator", "text": "*CRACK*"},
    { "name": "Kiernan", "text": "Huh? What was that?"},
    { "text": "..."},
    { "text": "Nothing seems to be out of place--"},
    { "text": "...Who's there?"},
    { "name": "Thug 1", "text": "Heh. How impressive. I'm surprised you managed to find us out.", "leftChar": "hachiware.png", "rightChar": "usagi.png"},
    { "name": "Kiernan", "text": "You severely underestimated me. An ambush won't be enough to take me down, especially after making a blunder like exposing yourself so easily."},
    { "name": "Thug 1", "text": "Don't get me wrong. Whatever that sound was, it didn't come from us."},
    { "name": "Kiernan", "text": "It doesn't matter. You don't know who you're dealing with."},
    { "name": "Thug 2", "text": "Is that a threat?"},
    { "name": "Thug 1", "text": "Enough talk. Get him!"},
    { "name": "narrator", "text": "Turn-based Battle", "minigame": "battle1", "music":"FU3.mp3"},
    { "name": "Thug 2", "text": "Damnit, run!", "music": "FU2.mp3"},
    { "name": "Thug 1", "text": "You don't have to tell me twice!"},
    { "name": "Kiernan", "text": "What nuisances. (Anyway, I should eat my well-deserved meal.)", "leftChar": "null", "rightChar": "null"},
    { "name": "narrator", "text": "*CRACK*"},
    { "name": "Kiernan", "text": "Huh? Again? Just what is that sound?"},
    { "name": "???", "text": "Ah, there you are."},
    { "name": "Kiernan", "text": "...Huh?"},
    { "name": "???", "text": "I was looking all over for you.", "char": "fed.png"},
    { "name": "Kiernan", "text": "What are you talking about? Who are you? (...Is he one of the guys I stole from before?)"},
    { "text": "Hmm, I see. You want to take revenge on me for stealing from you. (I'm confident in my abilities. Besides, he's only an old man. I can take him on.)"},
    { "name": "???", "text": "Settle down. I am not here to fight nor harm you."},
    { "name": "Kiernan", "text": "Is that so? (I can't let my guard down. He's clearly here to take advantage of me.)"},
    { "text": "(But I can also use this situation to my advantage too--)"},
    {
        "text": "(Make a choice before it's too late!)",
        "choices": [
            { "text": "Run away", "jump": "runAwayFromStranger", "alignment": "coward"},
            { "text": "Steal from the stranger", "jump": "stealFromStranger", "alignment": "evil"},
            { "text": "Talk with the stranger", "jump": "talkToStranger", "alignment": "friendship"}
    ]},

    { "next": "runAwayFromStranger", "name": "???", "text": "An old tactic you frequently use. Honestly, it's becoming quite tiring."},
    { "name": "Kiernan", "text": "Huh?! (It's like something is grabbing me!)"},
    { "name": "???", "text": "How many times are you going to run away?"},
    { "name": "Kiernan", "text": "Ugh..."},
    { "name": "???", "text": "Now then, I suppose introductions are in order.", "jump": "continueTalkingToStranger"},

    { "next": "stealFromStranger", "name": "Kiernan", "text": "(Even an old man like him can have something valuable on him. I can basically smell it!)"},
    { "name": "???", "text": "Don't even think about it. I can tell what you're thinking."},
    { "name": "Kiernan", "text": "!"},
    { "name": "???", "text": "But, don't worry. I'll forgive this transgression if you promise to give me a second to explain everything."},
    { "name": "Kiernan", "text": "(I-I almost got punished for committing thought crimes.)"},
    { "name": "???", "text": "Now then, I suppose introductions are in order.", "jump": "continueTalkingToStranger"},

    { "next": "talkToStranger", "name": "Kiernan", "text": "(...I don't know. Somehow, this old man...I don't think I can get away from messing with him.)"},
    { "text": "(Maybe, I'll play it safe and try to get on his good side.)"},
    { "text": "Can we...talk this out?"},
    { "name": "???", "text": "Ah, you're unusually cooperative right now. Strange, how strange."},
    { "name": "Kiernan", "text": "Huh?"},
    { "name": "???", "text": "But, no matter. I suppose some introductions and explainations are in order.", "jump": "continueTalkingToStranger"},

    { "next": "continueTalkingToStranger", "text": "I am Ulric, a humble teacher who teaches the art of magic."},
    { "name": "Kiernan", "text": "I see...what does a magic teacher want to do with me?"},
    { "name": "Ulric", "text": "Do not play dumb with me. I already know of your magic ability."},
    { "text": "A highly talented mage with affinities for fire and darkness. For someone who was self-taught, you are quite a capable magic user."},
    { "name": "Kiernan", "text": "You must be confusing me with someone else, old man. I'm just an ordinary person with absolutely no magic prowess."},
    { "name": "Ulric", "text": "A pointless lie. Any mage can see the mana oozing out from you."},
    { "name": "Kiernan", "text": "...*sigh* I guess, there wasn't any point in hiding it."},
    { "name": "Ulric", "text": "A useless endeavor."},
    { "name": "Kiernan", "text": "You--"},
    { "text": "(But now that I think about it, this old man is also a mage.)"},
    { "text": "(But if that's the case, why can't I sense any mana coming off of him?)"},
    { "name": "Ulric", "text": "Now, onto the most important question I have."},
    { "text": "You heard a loud crack sometime ago, correct?"},
    { "name": "Kiernan", "text": "Huh? (I did, but what does it have to do with this?)"},
    { "name": "Ulric", "text": "Look at the sky."},
    { "name": "narrator", "text": "It was a small sliver of a crack, but it was there. A small crack in the sky."},
    { "name": "Kiernan", "text": "T-The sky...! That definitely wasn't there before...!"},
    { "text": "What's going on?!"},
    { "name": "Ulric", "text": "Kiernan, you have to listen to me."},
    { "name": "Kiernan", "text": "What? How do you know my name?"},
    { "name": "Ulric", "text": "Kiernan."},
    { "text": "The world is ending."},
    { "name": "Kiernan", "text": "..."},
    { "text": "..."},
    { "text": "..."},
    { "text": "...What...?"},
    { "name": "Ulric", "text": "This world is past its prime and is collapsing as we speak. After centuries of erosion and weathering, I'm afraid that the world isn't able to hold on much longer."},
    { "name": "Kiernan", "text": "...What? What are you talking about...?!"},
    { "name": "Ulric", "text": "If humanity has to stop the collapse, we will need to collect the six Origin Crystals, forged by the Originator, scattered across the world."},
    { "text": "With the crystals in hand, we will be able to restore and rejuvenate the world, back to its prime."},
    { "name": "Kiernan", "text": "Stop! Hold it! Just let me have something to say!"},
    { "text": "You go off, spouting things like the world is gonna end and whatever crystals, but where's your proof?"},
    { "name": "Ulric", "text": "Isn't that the proof you need?"},
    { "name": "narrator", "text": "He points at the crack in the sky."},
    { "name": "Kiernan", "text": "...Yes, but it could be just some...unique weather phenomenon..."},
    { "name": "Ulric", "text": "Do you really believe that to be the case?"},
    { "name": "Kiernan", "text": "I can't just believe everything you've said."},
    { "text": "(I know something is up. This whole thing reeks of suspicion)"},
    { "name": "Ulric", "text": "How about this? I will show you one of the crystals. A genuine creation made by the Originator."},
    { "name": "Kiernan", "text": "One of the crystals?"},
    { "name": "Ulric", "text": "Yes. The crystals are what make up the world, both physical and incorporeal."},
    { "text": "The Originator created the Origin Crystals when he created the world and its first humans.", "char": "null"},
    { "text": "However, the humans lacked reason, thought, and morality. Thus, the Originator created the Light and Dark Crystals."},
    { "text": "The Light Crystal is the source of the righteousness and goodness of man, while the Dark Crystal is the source of the evil and wickedness of man."},
    { "text": "Without the Light Crystal, man would cast upon their vile desires unto others and the world. However, without the Dark Crystal, man would be content with stagnancy and wouldn't strive for change."},
    { "text": "The two create a balance upon which our world is built. They are called the Moral Crystals for they are the foundation of man's nature."},
    { "text": "However, the humans did not have a foothold to place their feet upon and drifted into the emptiness of space."},
    { "text": "So, the Originator forged the Earth Crystal to offer us the earth and land on which we place our feet on."},
    { "text": "The humans were grateful, but they could not voice their praises as they were deprived of oxygen and could not talk nor breathe."},
    { "text": "Thus, the Originator formed the Air Crystal to cleanse the atmosphere of impurities."},
    { "text": "The humans sang their praises, but their praises were cut short as they shivered in the bitter cold."},
    { "text": "Therefore, the Originator built the Fire Crystal to combat the frigid cold."},
    { "text": "The humans tried to say their thanks but could not speak as their throats were coarse."},
    { "text": "Finally, the Originator constructed the Water Crystal to satisfy our thirst."},
    { "text": "These four crystals make up the Elemental Crystals. Without them, we wouldn't be standing in a world where we can place our feet on and live."},
    { "name": "Kiernan", "text": "... (For something that is so essential to maintaining the world--how come I never heard of these so-called crystals?)"},
    { "name": "Ulric", "text": "Like I said before, I will show you one of the crystals, the Light Crystal.", "char": "fed.png"},
    { "name": "Kiernan", "text": "Hah! Can you, old man?"},
    { "name": "Ulric", "text": "Only if you come with me."},
    { "name": "Kiernan", "text": "No way! Why would I go with some shady guy like you?"},
    { "name": "Ulric", "text": "..."},
    { "name": "narrator", "text": "*whoosh*", "effect": "shake"},
    { "name": "Kiernan", "text": "Hey! What the-"},
    { "name": "Ulric", "text": "You give me no choice but to do this with force."},
    { "name": "Kiernan", "text": "Let me go!"},
    { "name": "Ulric", "text": "Not until you hear me out."},
    { "name": "Kiernan", "text": "Okay, fine! I’ll hear you out. Just let me down!"},
    { "name": "Ulric", "text": "Only a fool would believe you."},
    { "name": "Kiernan", "text": "Argh! You...!"},
    { "text": "...a church?"},
    { "name": "Ulric", "text": "Yes, the church has been overseeing the Light Crystal for centuries. It is a closely guarded secret that only a select few know."},
    { "name": "Kiernan", "text": "And how do you know this...?"},
    { "name": "Ulric", "text": "Because I am one of the select few who’s in the know."},
    { "name": "Kiernan", "text": "That doesn’t answer my question."},
    { "name": "Ulric", "text": "Anyway, I can show you the crystal as proof that the Origin Crystals do indeed exist. I’ll also let you down if you promise to behave."},
    { "name": "Kiernan", "text": "...Fine, I promise."},
    { "name": "narrator", "text": "Ulric lets Kiernan down."},
    { "name": "Kiernan", "text": "..."},
    {
        "text": "(Alright, time to dash!)",
        "choices": [
            { "text": "Run away", "jump": "runFromUlricChurch", "alignment": "coward"},
            { "text": "Behave", "jump": "behaveChurch", "alignment": "friendship"}
        ]
    },
    { "next": "runFromUlricChurch", "name": "Kiernan", "text": "Hah! See ya-"},
    { "name": "Kiernan", "text": "Huh?", "effect": "shake"},
    { "name": "Ulric", "text": "I knew you were going to do that. You are far too predictable."},
    { "name": "Kiernan", "text": "Argh! Okay, okay, fine I won't run away! Just let me down!"},
    { "name": "Ulric", "text": "Hmph. The little rascal you are. But, no matter.", "jump" : "goToChurch"},

    { "next":  "behaveChurch", "name": "Kiernan", "text": "(...On second thought, he'll probably catch me right away if I did...)"},
    { "text": "Ahem, well, shall we go now?"},
    { "name": "Ulric", "text": "Hmm, I did not expect you to behave so quickly. No matter. Come inside.", "jump":  "goToChurch"},

    { "next": "goToChurch", "name": "Kiernan", "text": "This is...", "char": "null"},
    { "name": "Ulric", "text": "The Originator, the god of this world, the one who created and shaped it.", "char": "fed.png"},
    { "name": "Kiernan", "text": "..."},
    { "text": "(I can't place my finger on why, but...there's this burning sensation in my chest. It almost feels like...)"},
    { "text": "(...a deep hatred, almost loathing. But, why?)"},
    { "text": "(...Heh, no, I know why. It's because for one who supposedly loves all of humanity, did he ever do anything to help me out of my situation?)"},
    { "text": "Old man, if the Originator is this high and almighty being, then wouldn't he be able to prevent the end of the world?"},
    { "name": "Ulric", "text": "He would be able to. But, divine intervention bears a heavy price."},
    { "name": "Kiernan", "text": "That's just basically saying that he can't fix this world without consequence."},
    { "name": "Ulric", "text": "I advise you not to speak ill of the one who created all of us and cared for our growth."},
    { "name": "Kiernan", "text": "... (He's angry. Better not pursue this topic anymore.)"},
    { "name": "Ulric", "text": "Hmph, but he is benevolent and merciful for he has given us a chance. A chance to prevent the end of the world with our own hands."},
    { "text": "The Originator does not guide mankind towards destruction but prosperity. Thus, the end of the world will be prevented."},
    { "name": "Kiernan", "text": "...okay. So, where is this so-called Light Crystal?"},
    { "name": "Ulric", "text": "This way."},
    { "name": "Kiernan", "text": "Huh? Wait for me!"},
    { "text": "Hey...where are we? Why are we all in the way in the back?"},
    { "name": "Ulric", "text": "This is where the Light Crystal is held."},
    { "name": "Kiernan", "text": "...This is just a wall."},
    { "name": "Ulric", "text": "The crystal is behind this wall. And I want you to open it."},
    { "name": "Kiernan", "text": "What are you on about?"},
    { "name": "Ulric", "text": "Consider this as another test. To prove that you are the chosen one that will save this world."},
    { "name": "Kiernan", "text": "That doesn't prove I'm a hero or anything. It's just opening a wall."},
    { "name": "Ulric", "text": "Go on, open it."},
    { "name": "Kiernan", "text": "(...He's ignoring me...)"},
    { "name": "narrator", "text": "Memory Game", "minigame": "memory"},

    { "name": "Ulric", "text": "I knew you had it in you. You really are a chosen one."},
    { "name": "Kiernan", "text": "Like I said, this doesn't prove anything!"},
    { "name": "Ulric", "text": "Shall we?"},
    { "name": "Kiernan", "text": "*cough* *cough* Ugh, why is it so dusty?!"},
    { "name": "Ulric", "text": "No one has been down here for years. Of course, the place would be covered in dust."},
    { "text": "The crystal is up ahead. No time for dilly-dallying."},
    { "name": "Kiernan", "text": "(This feeling... it's warm, kind. It almost feels like something ethereal.)", "char": "null"},
    { "name": "Kiernan", "text": "Is this the Light Crystal?"},
    { "name": "Ulric", "text": "It is.", "char": "fed.png"},
    { "name": "Kiernan", "text": "It's... beautiful..."},
    { "name": "Ulric", "text": "Do you believe me now?"},
    { "name": "Kiernan", "text": "(...the crystal feels so... powerful. Like it has been here since time immemorial.)"},
    { "name": "Ulric", "text": "Don't get too close to the crystal now."},
    { "name": "Kiernan", "text": "!"},
    { "name": "???", "text": "Every word you say, every creation you build, EVERYTHING that is that contains even a trace of your presence sickens me to the core.", "char": "null"},
    { "text": "I don't need a reason to hate your existence. After all, we're born to oppose one another, aren't we?"},
    { "text": "I can't help the way I was born like this. And neither can you."},
    { "name": "Kiernan", "text": "(W-What was that?!)", "char": "fed.png"},
    { "text": "(Ugh--there's so much hatred seeping out that my chest feels heavy--)"},
    { "name": "Ulric", "text": "Kiernan?"},
    { "name": "Kiernan", "text": "I--Did you feel that just now?"},
    { "name": "Ulric", "text": "I am not sure what you are talking about."},
    { "name": "Kiernan", "text": "(So, only I could see those memories?)"},
    { "name": "Ulric", "text": "Perhaps you are shellshocked of getting in close contact with one of the Originator's crystals."},
    { "name": "Kiernan", "text": "I...guess so... (I can't just ignore this, though.)"},
    { "name": "Ulric", "text": "Kiernan, you have to collect the rest of the crystals and save the world."},
    { "name": "Kiernan", "text": "But, why me? Why not ask someone more trustworthy or powerful like the archmages at the Mages' Guild?"},
    { "name": "Ulric", "text": "I do not trust them. They will likely use the crystals for illicit purposes."},
    { "text": "I trust you more than those archmages. You are more special than you realize."},
    { "name": "Kiernan", "text": "You act like we've known each other for years, but we haven't met until now."},
    { "name": "Ulric", "text": "I trust in my judgement."},
    { "name": "Kiernan", "text": "(Being tasked to save the world. Maybe this is my chance--my chance to find out my reason for living.)"},
    { "text": "(For all I can remember, I wandered the streets, just wanting to survive.)"},
    { "text": "(But, it became more than a desire to survive, but to actually live--live a purposeful life.)"},
    { "text": "(Maybe through this, I can finally find that purpose. Maybe through this, I can live a life I was proud of.)"},
    { "text": "(However...even though my brain is telling me that this is the greatest opportunity I could ever receive...why does my heart tell me no...?)"},
    {
        "text": "(What do I do?)",
        "choices": [
            { "text": "Become a hero", "jump":  "becomeHero"},
            { "text": "Reject becoming a hero", "jump":  "rejectHero"}
        ]
    },

    { "next": "rejectHero", "name": "Ulric", "text": "I'm sorry, I haven't heard your response yet. What do you say?"},
    {
	    "name": "",
        "text": "",
        "choices": [
            { "text": "Become a hero", "jump":  "questionBecomeHero"},
            { "text": "Reject becoming a hero", "jump":  "rejectHero"}
        ]
    },

    { "next": "questionBecomeHero", "name": "Kiernan", "text": "I...don't have a choice in the matter, do I?"},
    { "name": "Ulric", "text": "That is not true. You always had a choice."},
    { "text": "But rejecting your duty to save the world and its people-Doesn't it leave a bad taste in your mouth?"},
    { "name": "Kiernan", "text": "(I didn't ask to be a hero or something. This duty was suddenly thrusted upon me. I'm not some noble saint who is insanely kind. No, I couldn't care less about the world. All I wanted to do was survive."},
    { "text": "(But whenever I try to reject him, it feels like something is preventing me from voicing my objections..."},
    { "text": "I'll do it. But only if I'm rewarded.", "jump": "becomeHeroReal"},

    { "next": "becomeHero", "name": "Kiernan", "text": "Fine, I'll go along with this hero roleplay. But only if I'm rewarded for this."},
    { "text": "(Though, considering how adamant he is about this chosen one stuff, rejecting him would have probably ended worse for me.)", "jump": "becomeHeroReal"},

    { "next": "becomeHeroReal", "name": "", "text": "A look of relief washes over Ulric's face."},
    { "name": "Ulric", "text": "Thank you. This world will be saved after all."},
    { "name": "Kiernan", "text": "But you never told me why the world is ending."},
    { "name": "Ulric", "text": "I did, Kiernan. Were you not paying attention? The crystals eroded with time and with it, the world."},
    { "text": "And restoring the crystals, the foundation for this world, also means restoring the world."},
    { "name": "Kiernan", "text": "... (That doesn't make sense. Wouldn't a god's creations be more...immune to time and erosion?)"},
    { "text": "(Maybe it was because they were creations by a god or maybe because I was literally holding the foundation of the world in my hands, but...)"},
    { "text": "(...something about them felt dangerous. Those hate-filled memories definitely proved my point.)"},
    { "text": "(But, most importantly of all, there's no doubt about it.)"},
    { "text": "(This old man is hiding something. Something that he desperately doesn't want me to know.)"},
    { "text": "(And the key to solving what that something is lies in those memories.)"},
    { "text": "(I have to collect those crystals. Not to save the world but to find out what that old man is hiding and to find my reason for living.)"},

    { "name": "Kiernan", "text": "It's been a couple of days since I've seen the Light Crystal. Ever since I laid my eyes upon it, I couldn't stop thinking about it.", "char": "null", "music": "FU2 (harp vers).mp3"},
    { "text": "The old man chose me for a reason. The whole thing reeks of suspicion, and those memories held the key."},
    { "text": "First stop is the Earth Crystal. The old man said that he knew the exact location of only that one, though he says he's working on finding the rest."},
    { "text": "Where is the Earth Crystal, you ask? Apparently, it's located in the Elf Forest. Like its name suggests, it's home to the elves, a mystical and long-living race."},
    { "text": "Mana highly favors them, and people say that they were blessed by the Originator himself that they have such a high aptitude for magic."},
    { "text": "Though, I suppose the true source of their capabilities partly came from the mana oozing out of the Earth Crystal."},
    { "text": "Ugh, finally, I'm here."},
    { "text": "The closest town to the Elf Forest, Mortus."},
    { "name": "Kiernan", "text": "Time to start exploring."},
    { "name": "", "text": "",
        "choices": [
            { "text": "Go to plaza", "jump": "goToPlaza", "setFlag": "wentToPlaza"},
            { "text": "Go to marketplace", "jump": "goToMarket", "setFlag": "wentToMarket"}
        ]
    },
    { "next": "goToPlaza", "name": "Kiernan", "text": "This should be the plaza. It's eeriely quiet."},
    { "text": "Let's go somewhere else.", "checkFlag": "wentToMarket"},
    { "text": "text",
        "choices": [
            { "text": "Go to marketplace", "jump": "goToMarket"}
        ]
    },
    { "next": "goToMarket", "name": "Kiernan", "text": "The marketplace should have been the most bustling place in the town. And yet, not a single soul in sight."},
    { "text": "Let's go somewhere else.", "checkFlag": "wentToPlaza"},
    { "text": "",
        "choices": [
            { "text": "Go to plaza", "jump": "goToPlaza"}
        ]
    },
    { "goToFlag": "wentToPlaza", "text": "went to plaza first", "jump": "finishedTown"},
    { "goToFlag": "wentToMarket", "text": "went to market first", "jump": "finishedTown"},
    { "next": "finishedTown", "text": "That's weird. Where is everybody?", "music": "amiss.mp3"},
    { "text": "This place shouldn't be so deserted."},
    { "name": "???", "text": "Hello, dearie."},
    { "name": "Kiernan", "text": "Hmm?"},
    { "name": "???", "text": "Would you like a snack?"},
    { "name": "Kiernan", "text": "Should I accept?",
        "choices": [
            { "text": "Accept the snacks", "jump": "acceptSnacks"},
            { "text": "Reject", "jump": "rejectSnacks"}
        ]
    },

    { "next": "acceptSnacks", "name": "Kiernan", "text": "Oh... thanks..."},
    { "text": "...", "jump": "battleResidents"},
    { "next": "rejectSnacks", "name": "Kiernan", "text": "(No, don't trust strangers.)"},
    { "text": "...", "jump": "battleResidents"},

    { "next": "battleResidents", "name": "Resident?", "text": "Stay still..."},
    { "name": "narrator", "text": "Eyes turned to Kiernan."},
    { "name": "Kiernan", "text": "...Bring it."},
    { "name": "narrator", "text": "Turn-based Battle", "minigame": "battle2", "music": "FU3.mp3"},

    { "name": "Kiernan", "text": "...Hah...hah...damn, there's too many of them.", "music": "FU2 (harp vers).mp3"},
    { "name": "???", "text": "Need some help?"},
    { "name": "Kiernan", "text": "?"},
    { "name": "narrator", "text": "A figure was perched on top of one of the rooftops. Her ears were distinctively long and pointed."},
    { "name": "???", "text": "Though, I have to say, you look like you're doing fine by yourself."},
    { "name": "Kiernan", "text": "Should I ask for her help?",
        "choices": [
            { "text": "Accept her help", "jump": "acceptHelp"},
            { "text": "Reject", "jump": "rejectHelp"}
        ]
    },
    { "next": "acceptHelp", "name": "Kiernan", "text": "I'll like a helping hand, thanks!"},
    { "name": "???", "text": "Well, then."},
    { "name": "narrator", "text": "A flash of colors breezed by, then the zombies were quickly wiped out."},
    { "name": "Kiernan", "text": "(Wow, as expected from an elf. She completely obliterated them.)", "jump": "introduceGui"},

    { "next": "rejectHelp", "name": "Kiernan", "text": "I can do this on my own."},
    { "name": "???", "text": "Hmph. If you say so."},
    { "name": "Kiernan", "text": "*wheezes*"},
    { "name": "???", "text": "If a lady offers you her help, you must gladly accept."},
    { "name": "Kiernan", "text": "Well, sorry for not follow proper etiquette, \"miss\""},
    { "name": "???", "text": "I do not appreciate your attitude.", "jump": "introduceGui"},

    { "next": "introduceGui", "name": "???", "text": "I suppose introductions are in order. I am Guinevere, a quad-elemental mage."},
    { "name": "Kiernan", "text": "(What a way to brag. Humans usually can only control one or two elements. But a mage who can use four elements? Elves are something else.)"},
    { "name": "Guinevere", "text": "You're the first human who I've seen survived here. What's your name?"},
    { "name": "Kiernan", "text": "First human? You mean, there were others who came here too?"},
    { "name": "Guinevere", "text": "I asked you a question first."},
    { "name": "Kiernan", "text": "...Kiernan."},
    { "name": "Guinevere", "text": "Thank you, Kiernan. Yes, humans from the Mages' Guild. I suppose they came here to investigate the strange disappearance in Mortus."},
    { "name": "Kiernan", "text": "So, why are you then?"},
    { "name": "Guinevere", "text": "Why, isn't it obvious? I'm here to stop whatever is plaguing this town and creating these abdominations."},
    { "text": "I'm afraid all of the residents have been converted into undead. However, something else is conjuring up more of them."},
    { "text": "Unfortunately, even with my prowess, if I'm unable to find the source of the undead, it doesn't matter how many I purify. They'll keep coming back until we destroy the source."},
    { "name": "Kiernan", "text": "What's strange to me is that they don't act like ordinary undead. One of them even spoke to me in a manner close to a living person."},
    { "name": "Guinevere", "text": "Even with all my searching, I still couldn't find the source. I can sense you wield the dark element, Kiernan. The source should definitely be of the dark element."},
    { "text": "You'll be able to sense it, wouldn't you?"},
    { "name": "Kiernan", "text": "Should I accept?",
        "choices": [
            { "text": "Help Guinevere", "jump": "helpGui"},
            { "text": "Ignore Guinevere", "jump": "ignoreGui", "setFlag": "guiDislike"}
        ]
    },
    { "next": "helpGui", "name": "Kiernan", "text": "I'll help you."},
    { "name": "Guinevere", "text": "Thank you."},

    { "name": "narrator", "text": "add more dialogue later"},

    { "name": "narrator", "text": "The pair are standing in front of the town."},
    { "name": "Guinevere", "text": "May you find everlasting peace in the afterlife."},
    { "name": "Kiernan", "text": "..."},
    { "name": "Guinevere", "text": "Come on, be respectful."},
    { "name": "Kiernan", "text": "Ugh, fine. May you find peace."},
    { "name": "Guinevere", "text": "Would it kill you to be nice every once in a while?"},
    { "name": "Kiernan", "text": "...Hmph. Anyway, you said that your family might have something to do with the outbreak."},
    { "name": "Guinevere", "text": "...Yes, it's my family's signature magic."},
    { "name": "Kiernan", "text": "(I can tell that she doesn't want to talk about her family that much.)"},
    { "name": "Guinevere", "text": "I have to confront them about this. How could they experiment with the undead like this?"},
    { "name": "Kiernan", "text": "I'll go with you."},
    { "name": "Guinevere", "text": "Huh? Oh, there's no need. I don't want to drag you into my family affairs."},
    { "name": "Kiernan", "text": "No, I have to go."},
    { "name": "Guinevere", "text": "*sigh* I'm not sure if I would be able to get out of this mess unscathed if it wasn't for you. I'll allow you to come with me despite my misgivings about your motives."},
    { "name": "Kiernan", "text": "Thanks."},

    { "name": "narrator", "text": "add more dialogue later"},
    { "name": "Guinevere", "text": "Well, this is the Earth Crystal.", "music": "C2.mp3"},
    { "name": "Kiernan", "text": "(This one gives off a feeling of vitality. It's like I can run a hundred laps, and I wouldn't feel tired.)"},
    { "name": "Guinevere", "text": "The crystal doesn't appear to be corrupted. However, that doesn't clear the suspicion that my family has done something illicit with it."},
    { "name": "narrator", "text": "*snatch*"},
    { "name": "Guinevere", "text": "What?!"},
    { "name": "???", "text": "Heh, I didn't expect the Earth Crystal would be such an easy catch."},
    { "name": "narrator", "text": "A figure quickly disappeared into the wind."},
    { "name": "Guinevere", "text": "Argh, there's no way--"},
    { "name": "narrator", "text": "Guinevere grabbed Kiernan by the arm."},
    { "name": "Kiernan", "text": "Ow! What the--"},
    { "name": "Guinevere", "text": "After him!"},
    { "name": "narrator", "text": "Using her air magic, she brought the two of them to give chase after the thief.", "jump": "zarekIntoLake"},

    { "next": "ignoreGui", "name": "Kiernan", "text": "(There's no time to waste here. I should go look for the Earth Crystal instead.)"},
    { "text": "I can't help you."},
    { "name": "Guinevere", "text": "What--don't you see these undead roaming around? They used to be the residents of this town. Don't you want to bring them peace and help their souls move to the afterlife?"},
    { "name": "Kiernan", "text": "Sorry, I have something important I need to do."},
    { "name": "Guinevere", "text": "Why you?! Aren't you ashamed of yourself?"},
    { "name": "Kiernan", "text": "I'm not a naturally good person. Best of luck to you."},
    { "text": "(I wanted to find a place to rest, but if the town is infested with undead, then there's no way I could rest peacefully. Better off to the Elf Forest then.)"},

    { "name": "narrator", "text": "add more dialogue later"},

    { "name": "Kiernan", "text": "So, this is where the Earth Crystal is held.", "music": "C2.mp3"},
    { "name": "Guinevere", "text": "Ugh, you insufferable--"},
    { "name": "Kiernan", "text": "Huh? Guinevere? You look terrible."},
    { "name": "Guinevere", "text": "And I wonder why, leaving me to find the source myself and plunging head-first into a horde of undead."},
    { "name": "Kiernan", "text": "But why are you here?"},
    { "name": "Guinevere", "text": "Like I should tell you."},
    { "name": "narrator", "text": "She walked up to the crystal and examined it closely."},
    { "name": "Guinevere", "text": "...Seems untouched."},
    { "name": "narrator", "text": "*snatch*"},
    { "name": "Guinevere", "text": "What?!"},
    { "name": "???", "text": "Heh, I didn't expect the Earth Crystal would be such an easy catch."},
    { "name": "narrator", "text": "A figure quickly disappeared into the wind."},
    { "name": "Guinevere", "text": "Argh, there's no way--"},
    { "name": "narrator", "text": "Guinevere quickly gave chase, using air magic."},
    { "name": "Kiernan", "text": "Wait, what about me?! (No way, she didn't take me with her?! Maybe I should have helped her--)"},
    { "text": "(Damn, this is really going to drain my mana.)"},
    { "name": "narrator", "text": "Kiernan blended into the shadows to also give chase.", "jump": "zarekIntoLake"},

    { "next": "zarekIntoLake", "name": "narrator", "text": "Chasing after the thief for nearly a couple of minutes, they stopped by a lake."},
    { "name": "narrator", "text": "The thief quickly chugged something down before diving into the lake."},
    { "name": "Guinevere", "text": "Argh--I lost him!"},
    { "name": "Kiernan", "text": "Can't you use water magic and give us the ability to breathe underwater?"},
    { "name": "Guinevere", "text": "An average water mage can't use that spell. It is a highly advanced spell that I haven't learned yet."},
    { "name": "Kiernan", "text": "Ugh, so what do we do?"},
    { "name": "Guinevere", "text": "Don't lose heart yet. We can go back to the Elf Forest and find someone who can sell us an underwater breathing potion."},
    { "name": "Kiernan", "text": "...Right, I guess that is our only option."},
    { "text": "(This wasn't how I imagine my first collection of the crystal to turn out.)"}
]
